<template>
    <div class="post-page" :style="{minHeight: this.postHeight}">
      <div class="post">
        <p class="post-title">{{post.title}}</p>
        <div class="post-info">
          <p class="post-author"><span><strong>Author: </strong></span>{{post.author}}</p>
          <p class="post-category"><span><strong>Category: </strong></span>{{post.category}}</p>
          <p class="post-date"><span><strong>Published Date: </strong></span>{{post.publishedDate}}</p>
          <div class="clear"></div>
        </div>
        <div class="post-content">{{post.content}}</div>
      </div>
    </div>
</template>

<script>
export default {
  name: 'Post',
  data () {
    return {
      post: {
        id: 5,
        title: '一篇不靠谱的文章',
        content: '网站配色方案一：简单的、时尚的、高雅的\n' +
        '如今极简设计已普遍被应用于网页设计中，当然这拥有充分理由。轻量级的布局和低维修成本使其灵活适合于响应式设计。自然优雅极具美感，使得很多品牌和机构青睐并采用。然而赞赏这一设计风格和创造它是两码事。\n' +
        '看起来，由于极简主义元素不多，复制某种风格似乎变的及其容易。然而事实却正好相反，由于设计师可利用的元素极少，创造一个极简主义的设计设计师往往要付出更多思考和努力。对极简主义来说，无聊始终是一种威胁，所以改变你的布局以进一步吸引用户，交替沿z字形布局模式可以帮助阅读。网站配色方案二：简单的、洁净的、进步的\n' +
        '当你的网站上没有大量装饰性元素的时候，内容就成了主角，这便于访客浏览。有一个调查显示，79%的受访用户只是在浏览一个新页面，只有16%的用户会逐字逐句去读一个页面。通过把网站的内容放在前面中间的位置，让访客能快速浏览那些是什么内容。网站配色方案三：高尚的、自然的、安稳的\n' +
        '高尚一般要用低亮度的黄绿色，色彩亮度降下去，注意色彩的平衡，页面就会显得安稳网站配色方案四：冷静的、自然的\n' +
        '绿色是冷静、自然印象的主角，但是绿色作为页面的主要色彩，容易陷入过于消极的感觉传达，因此应该特别重视图案的设计。网站配色方案五：传统的、稳重的、古典的\n' +
        '传统的内容一般要降低色彩的饱和度，特别是棕色很适合。前面介绍紫色也是高雅和优雅印象的常用色相。网站配色方案六：传统的、高雅的、优雅的\n' +
        '灰色是最为平衡的色彩，并且是塑料金属质感的主要色彩之一，因而要表达高雅、时尚，可以适当使用，甚至大面积使用。但是要注重图案和质感的构造。网站配色方案七：忠厚的、稳重的、有品位的\n' +
        '亮度、饱和度偏低的色彩会给人忠厚、稳重的感觉。这样的搭配为了避免色彩过于保守，使页面僵化、消极，应当注重冷暖结合和明暗对比。网站配色方案八：轻快的、华丽的、动感的\n' +
        '动感的印象空间中少不了低亮度的色彩，甚至可以用适当的黑色搭配。其他有彩色的饱和度高，对比强烈。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。网站配色方案九：运动型的、轻快的\n' +
        '运动的色彩要强化激烈、刺激的感受，同时还要体现健康、快乐、阳光。因此饱和度较高、亮度偏低的色彩在这类印象中经常登场。',
        publishedDate: '2018-01-01',
        author: '不靠谱',
        category: 'Funny'
      },
      postHeight: window.innerHeight + 'px'
    }
  }
}
</script>

<style scoped>
  .post-page {
    opacity: 0.9;
    width: 800px;
    margin: 0 auto;
    background-color: #ffffff;
    box-shadow: -3px 3px 5px dimgray;
    border-left: 5px dashed #666666;
    border-right: 5px dashed #666666;
  }
  .post {
    margin: 0 50px;
  }
  .post-page:hover {
    box-shadow: -2px 5px 15px #ffffff;
  }
  .post-title {
    margin-top: 0;
    padding-top: 50px;
    padding-bottom: 30px;
    font-size: 1.3em;
    color: #7cb7dc;
    border-bottom: 1px dashed #666666;
  }
  .post-info {
    font-style: oblique;
    font-size: 0.9em;
    color: #74777b;
  }
  .post-info span {
    color: darkslateblue;
  }
  .post-author {
    width: 33%;
    float: left;
    text-align: left;
  }
  .post-category {
    width: 33%;
    float: left;
    text-align: center;
  }
  .post-date {
    width: 33%;
    float: left;
    text-align: right;
  }
  .post-content {
    color: #000000;
    margin-top: 30px;
    margin-bottom: 0;
    padding-bottom: 50px;
    line-height: 35px;
  }

</style>
